#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
<details><summary>Validation Output</summary>

```
[command]/home/runner/work/_temp/0fe3fb4a-b613-4bb6-b868-c88743252dc7/terraform-bin validate -no-color
2025-07-27T22:41:30.483Z [INFO]  Terraform version: 1.2.5
2025-07-27T22:41:30.483Z [INFO]  Go runtime version: go1.18.1
2025-07-27T22:41:30.483Z [INFO]  CLI args: []string{"/home/runner/work/_temp/0fe3fb4a-b613-4bb6-b868-c88743252dc7/terraform-bin", "validate", "-no-color"}
2025-07-27T22:41:30.483Z [INFO]  CLI command args: []string{"validate", "-no-color"}
2025-07-27T22:41:31.082Z [INFO]  provider: configuring client automatic mTLS
2025-07-27T22:41:31.132Z [INFO]  provider.terraform-provider-aws_v3.76.1_x5: configuring server automatic mTLS: timestamp=2025-07-27T22:41:31.132Z
2025-07-27T22:41:31.313Z [INFO]  provider: configuring client automatic mTLS
2025-07-27T22:41:31.365Z [INFO]  provider.terraform-provider-aws_v3.76.1_x5: configuring server automatic mTLS: timestamp=2025-07-27T22:41:31.365Z
Success! The configuration is valid.

::debug::Terraform exited with code 0.
::debug::stdout: Success! The configuration is valid.%0A%0A
::debug::stderr: 2025-07-27T22:41:30.483Z [INFO]  Terraform version: 1.2.5%0A2025-07-27T22:41:30.483Z [INFO]  Go runtime version: go1.18.1%0A2025-07-27T22:41:30.483Z [INFO]  CLI args: []string{"/home/runner/work/_temp/0fe3fb4a-b613-4bb6-b868-c88743252dc7/terraform-bin", "validate", "-no-color"}%0A2025-07-27T22:41:30.483Z [INFO]  CLI command args: []string{"validate", "-no-color"}%0A2025-07-27T22:41:31.082Z [INFO]  provider: configuring client automatic mTLS%0A2025-07-27T22:41:31.132Z [INFO]  provider.terraform-provider-aws_v3.76.1_x5: configuring server automatic mTLS: timestamp=2025-07-27T22:41:31.132Z%0A2025-07-27T22:41:31.313Z [INFO]  provider: configuring client automatic mTLS%0A2025-07-27T22:41:31.365Z [INFO]  provider.terraform-provider-aws_v3.76.1_x5: configuring server automatic mTLS: timestamp=2025-07-27T22:41:31.365Z%0A
::debug::exitcode: 0
```

</details>

#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```
[command]/home/runner/work/_temp/0fe3fb4a-b613-4bb6-b868-c88743252dc7/terraform-bin show -no-color tfplan
2025-07-27T22:41:33.795Z [INFO]  Terraform version: 1.2.5
2025-07-27T22:41:33.795Z [DEBUG] using github.com/hashicorp/go-tfe v1.0.0
2025-07-27T22:41:33.795Z [DEBUG] using github.com/hashicorp/hcl/v2 v2.12.0
2025-07-27T22:41:33.795Z [DEBUG] using github.com/hashicorp/terraform-config-inspect v0.0.0-20210209133302-4fd17a0faac2
2025-07-27T22:41:33.795Z [DEBUG] using github.com/hashicorp/terraform-svchost v0.0.0-20200729002733-f050f53b9734
2025-07-27T22:41:33.795Z [DEBUG] using github.com/zclconf/go-cty v1.10.0
2025-07-27T22:41:33.795Z [INFO]  Go runtime version: go1.18.1
2025-07-27T22:41:33.795Z [INFO]  CLI args: []string{"/home/runner/work/_temp/0fe3fb4a-b613-4bb6-b868-c88743252dc7/terraform-bin", "show", "-no-color", "tfplan"}
2025-07-27T22:41:33.795Z [DEBUG] Attempting to open CLI config file: /home/runner/.terraformrc
2025-07-27T22:41:33.796Z [DEBUG] File doesn't exist, but doesn't need to. Ignoring.
2025-07-27T22:41:33.796Z [DEBUG] ignoring non-existing provider search directory terraform.d/plugins
2025-07-27T22:41:33.796Z [DEBUG] ignoring non-existing provider search directory /home/runner/.terraform.d/plugins
2025-07-27T22:41:33.796Z [DEBUG] ignoring non-existing provider search directory /home/runner/.local/share/terraform/plugins
2025-07-27T22:41:33.796Z [DEBUG] ignoring non-existing provider search directory /usr/local/share/terraform/plugins
2025-07-27T22:41:33.796Z [DEBUG] ignoring non-existing provider search directory /usr/share/terraform/plugins
2025-07-27T22:41:33.796Z [INFO]  CLI command args: []string{"show", "-no-color", "tfplan"}
2025-07-27T22:41:34.395Z [DEBUG] checking for provisioner in "."
2025-07-27T22:41:34.395Z [DEBUG] checking for provisioner in "/home/runner/work/_temp/0fe3fb4a-b613-4bb6-b868-c88743252dc7"
2025-07-27T22:41:34.395Z [DEBUG] created provider logger: level=debug
2025-07-27T22:41:34.395Z [INFO]  provider: configuring client automatic mTLS
2025-07-27T22:41:34.415Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.76.1/linux_amd64/terraform-provider-aws_v3.76.1_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/aws/3.76.1/linux_amd64/terraform-provider-aws_v3.76.1_x5]
2025-07-27T22:41:34.415Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.76.1/linux_amd64/terraform-provider-aws_v3.76.1_x5 pid=2255
2025-07-27T22:41:34.415Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.76.1/linux_amd64/terraform-provider-aws_v3.76.1_x5
2025-07-27T22:41:34.446Z [INFO]  provider.terraform-provider-aws_v3.76.1_x5: configuring server automatic mTLS: timestamp=2025-07-27T22:41:34.446Z
2025-07-27T22:41:34.466Z [DEBUG] provider: using plugin: version=5
2025-07-27T22:41:34.466Z [DEBUG] provider.terraform-provider-aws_v3.76.1_x5: plugin address: address=/tmp/plugin4000618871 network=unix timestamp=2025-07-27T22:41:34.465Z
2025-07-27T22:41:34.606Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2025-07-27T22:41:34.609Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.76.1/linux_amd64/terraform-provider-aws_v3.76.1_x5 pid=2255
2025-07-27T22:41:34.609Z [DEBUG] provider: plugin exited

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.example will be created
  + resource "aws_instance" "example" {
      + ami                                  = "ami-02da2f5b47450f5a8"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "terraform"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags_all                             = (known after apply)
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-0ad10b5c714b930c3",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + example_ip = (known after apply)
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_instance.example will be created%0A  + resource "aws_instance" "example" {%0A      + ami                                  = "ami-02da2f5b47450f5a8"%0A      + arn                                  = (known after apply)%0A      + associate_public_ip_address          = (known after apply)%0A      + availability_zone                    = (known after apply)%0A      + cpu_core_count                       = (known after apply)%0A      + cpu_threads_per_core                 = (known after apply)%0A      + disable_api_termination              = (known after apply)%0A      + ebs_optimized                        = (known after apply)%0A      + get_password_data                    = false%0A      + host_id                              = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_initiated_shutdown_behavior = (known after apply)%0A      + instance_state                       = (known after apply)%0A      + instance_type                        = "t2.micro"%0A      + ipv6_address_count                   = (known after apply)%0A      + ipv6_addresses                       = (known after apply)%0A      + key_name                             = "terraform"%0A      + monitoring                           = (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + placement_partition_number           = (known after apply)%0A      + primary_network_interface_id         = (known after apply)%0A      + private_dns                          = (known after apply)%0A      + private_ip                           = (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      + secondary_private_ips                = (known after apply)%0A      + security_groups                      = (known after apply)%0A      + source_dest_check                    = true%0A      + subnet_id                            = (known after apply)%0A      + tags_all                             = (known after apply)%0A      + tenancy                              = (known after apply)%0A      + user_data                            = (known after apply)%0A      + user_data_base64                     = (known after apply)%0A      + vpc_security_group_ids               = [%0A          + "sg-0ad10b5c714b930c3",%0A        ]%0A%0A      + capacity_reservation_specification {%0A          + capacity_reservation_preference = (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id = (known after apply)%0A            }%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      + enclave_options {%0A          + enabled = (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      + metadata_options {%0A          + http_endpoint               = (known after apply)%0A          + http_put_response_hop_limit = (known after apply)%0A          + http_tokens                 = (known after apply)%0A          + instance_metadata_tags      = (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      + root_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + example_ip = (known after apply)%0A
::debug::stderr: 2025-07-27T22:41:33.795Z [INFO]  Terraform version: 1.2.5%0A2025-07-27T22:41:33.795Z [DEBUG] using github.com/hashicorp/go-tfe v1.0.0%0A2025-07-27T22:41:33.795Z [DEBUG] using github.com/hashicorp/hcl/v2 v2.12.0%0A2025-07-27T22:41:33.795Z [DEBUG] using github.com/hashicorp/terraform-config-inspect v0.0.0-20210209133302-4fd17a0faac2%0A2025-07-27T22:41:33.795Z [DEBUG] using github.com/hashicorp/terraform-svchost v0.0.0-20200729002733-f050f53b9734%0A2025-07-27T22:41:33.795Z [DEBUG] using github.com/zclconf/go-cty v1.10.0%0A2025-07-27T22:41:33.795Z [INFO]  Go runtime version: go1.18.1%0A2025-07-27T22:41:33.795Z [INFO]  CLI args: []string{"/home/runner/work/_temp/0fe3fb4a-b613-4bb6-b868-c88743252dc7/terraform-bin", "show", "-no-color", "tfplan"}%0A2025-07-27T22:41:33.795Z [DEBUG] Attempting to open CLI config file: /home/runner/.terraformrc%0A2025-07-27T22:41:33.796Z [DEBUG] File doesn't exist, but doesn't need to. Ignoring.%0A2025-07-27T22:41:33.796Z [DEBUG] ignoring non-existing provider search directory terraform.d/plugins%0A2025-07-27T22:41:33.796Z [DEBUG] ignoring non-existing provider search directory /home/runner/.terraform.d/plugins%0A2025-07-27T22:41:33.796Z [DEBUG] ignoring non-existing provider search directory /home/runner/.local/share/terraform/plugins%0A2025-07-27T22:41:33.796Z [DEBUG] ignoring non-existing provider search directory /usr/local/share/terraform/plugins%0A2025-07-27T22:41:33.796Z [DEBUG] ignoring non-existing provider search directory /usr/share/terraform/plugins%0A2025-07-27T22:41:33.796Z [INFO]  CLI command args: []string{"show", "-no-color", "tfplan"}%0A2025-07-27T22:41:34.395Z [DEBUG] checking for provisioner in "."%0A2025-07-27T22:41:34.395Z [DEBUG] checking for provisioner in "/home/runner/work/_temp/0fe3fb4a-b613-4bb6-b868-c88743252dc7"%0A2025-07-27T22:41:34.395Z [DEBUG] created provider logger: level=debug%0A2025-07-27T22:41:34.395Z [INFO]  provider: configuring client automatic mTLS%0A2025-07-27T22:41:34.415Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.76.1/linux_amd64/terraform-provider-aws_v3.76.1_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/aws/3.76.1/linux_amd64/terraform-provider-aws_v3.76.1_x5]%0A2025-07-27T22:41:34.415Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.76.1/linux_amd64/terraform-provider-aws_v3.76.1_x5 pid=2255%0A2025-07-27T22:41:34.415Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.76.1/linux_amd64/terraform-provider-aws_v3.76.1_x5%0A2025-07-27T22:41:34.446Z [INFO]  provider.terraform-provider-aws_v3.76.1_x5: configuring server automatic mTLS: timestamp=2025-07-27T22:41:34.446Z%0A2025-07-27T22:41:34.466Z [DEBUG] provider: using plugin: version=5%0A2025-07-27T22:41:34.466Z [DEBUG] provider.terraform-provider-aws_v3.76.1_x5: plugin address: address=/tmp/plugin4000618871 network=unix timestamp=2025-07-27T22:41:34.465Z%0A2025-07-27T22:41:34.606Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"%0A2025-07-27T22:41:34.609Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.76.1/linux_amd64/terraform-provider-aws_v3.76.1_x5 pid=2255%0A2025-07-27T22:41:34.609Z [DEBUG] provider: plugin exited%0A
::debug::exitcode: 0
```

</details>

*Pushed by: @Kaligar, Action: `pull_request`*